import 'dart:developer';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:intl/intl.dart';
import 'package:refrigerator/youtube_api/youtube_api.dart';
import 'package:refrigerator/youtube_api/yt_video.dart';
import 'package:shared_preferences/shared_preferences.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

import 'json_data.dart';
import 'my_main.dart';

class ytPlay extends StatefulWidget {
  String data;

  ytPlay({Key? key, required this.data}) : super(key: key);

  @override
  _ytPlayState createState() => _ytPlayState(this.data);
}

class _ytPlayState extends State<ytPlay> {
  // Youtube API를 사용하기 위한 고유 key.
  // 일당 10,000 query 지원
  // 해당 query 초과시 key값을 바꿔야됨
  // 초과시 다음의 key 로 바꾸세요!.
  // AIzaSyBA3z_uabghRz3RhkW26vrE3RDthkgHoBc
  // AIzaSyDvrFW2FCTr_mkWz5-Kv_-UGpRca6ftmHc
  static String key = "AIzaSyBA3z_uabghRz3RhkW26vrE3RDthkgHoBc";
  List<ListData> saved_data = [];

  // search 할 string 을 담는 변수
  String _data;
  YoutubeAPI ytApi = YoutubeAPI(
    key,
  );

  // search 한 결과를 Youtube API 로부터 받는 List 변수
  List<YT_API> ytResult = [];

  _ytPlayState(this._data);

  RecipeList list = RecipeList.fromJson([
    {
      'name': '[아스파라거스 요리]아스파라거스 베이컨말이',
      'ingre': [
        "아스파라거스",
        "피자치즈",
        "만두피",
        "베이컨",
        "식용유",
      ],
    },
    {
      'name': '콘샐러드 만들기,콘샐러드 만드는 법,콘슬로우 샐러드',
      'ingre': [
        "캔옥수수",
        "당근",
        "양파",
        "마요네즈",
        "설탕",
        "식초",
        "소금",
      ],
    },
    {
      'name': '[노오븐베이킹]방학 아이들간식 밥통 카스테라 만들기,밥통 케이크',
      'ingre': [
        "계란",
        "버터",
        "우유",
        "머핀믹스",
      ],
    },
    {
      'name': '꼬마김밥,마약김밥 만들기,마약김밥소스만들기',
      'ingre': [
        "당근",
        "부추",
        "단무지",
        "햄(김밥용)",
        "밥",
        "김(김밥용)",
        "간장",
        "설탕",
        "연겨자",
        "미림",
        "다진청양고추",
        "물",
        "소금",
        "통깨",
        "참기름",
      ],
    },
    {
      'name': ' [백종원레시피]백종원 크림새우 만들기,집밥백선생 크림새우',
      'ingre': [
        "튀김가루",
        "물",
        "자숙새우",
        "식용유",
        "설탕",
        "마요네즈",
        "식초",
      ],
    },
    {
      'name': '설렁탕집깍두기담그는법,깍두기담그는법',
      'ingre': [
        "무",
        "대파",
        "고추가루",
        "다진마늘",
        "생강가루",
        "액젓",
        "새우젓",
        "설탕",
        "굵은소금",
        "뉴슈가",
        "밀가루",
        "물",
      ],
    },
    {
      'name': '[일본식 계란덮밥]텐신항 만들기,달걀덮밥,일본덮밥,한그릇레시피',
      'ingre': [
        "밥",
        "계란",
        "크래미",
        "쪽파",
        "소금",
        "물",
        "전분가루",
        "맛술",
        "치킨스톡",
        "식초",
        "간장",
        "설탕",
      ],
    },
    {
      'name': '돼지고기 수육삶는법,보쌈 삶는법,보쌈김치만드는 법',
      'ingre': [
        "알배추",
        "무",
        "보쌈용돼지고기",
        "굵은소금",
        "뉴슈가",
        "쪽파",
        "생강가루",
        "마늘",
        "고추가루",
        "매실청",
        "올리고당",
        "새우젓",
        "통깨",
        "새우젓",
        "액젓",
        "고추가루",
        "설탕",
        "마늘",
        "매실청",
        "양파",
        "대파",
        "통마늘",
        "통생강",
        "통후추",
        "된장",
        "커피가루",
      ],
    },
    {
      'name': '[7월제철]냉동블루베리 잼 만드는 법,쨈만들기',
      'ingre': [
        "설탕",
        "블루베리",
        "레몬즙",
      ],
    },
    {
      'name': '[무요리]백종원 무소박이 만들기,백종원 무김치 ',
      'ingre': [
        "무",
        "부추",
        "당근",
        "물",
        "밀가루",
        "양파",
        "액젓",
        "설탕",
        "새우젓",
        "굵은소금",
        "설탕",
        "물",
        "고추가루",
        "간생강",
        "마늘",
      ],
    },
    {
      'name': '[밑반찬레시피]미역줄기볶음 만드는 법',
      'ingre': [
        "미역줄기",
        "당근",
        "양파",
        "식용유",
        "마늘",
        "참기름",
        "국간장",
        "통깨",
      ],
    },
    {
      'name': '[샌드위치 레시피]감자샌드위치 만드는 법,오이감자샌드위치 ',
      'ingre': [
        "식빵",
        "감자",
        "오이",
        "계란",
        "햄(마늘햄)",
        "소금",
        "설탕",
        "소금",
        "마요네즈",
        "머스타드소스",
      ],
    },
    {
      'name': '[밑반찬레시피]우엉조림맛있게하는법,우엉조림만드는법',
      'ingre': [
        "우엉",
        "다시다",
        "간장",
        "설탕",
        "참기름",
        "물엿",
        "깨",
      ],
    },
    {
      'name': ' 깐마늘장아찌 만드는법,고추장마늘장아찌 맛있게만드는법 ',
      'ingre': [
        "통마늘",
        "간장",
        "식초",
        "물",
        "설탕",
      ],
    },
    {
      'name': '비가오면 생각나는 부침개~색다르게 반반부침개로 만들기',
      'ingre': [
        "부침가루",
        "물",
        "호박",
        "부추",
        "김치",
        "설탕",
        "고추가루",
        "식용유",
      ],
    },
    {
      'name': '간단한 돈까스 만드는법,돈까스 만들기',
      'ingre': [
        "돼지등심",
        "밀가루",
        "빵가루",
        "계란",
        "식용유",
        "허브솔트",
      ],
    },
    {
      'name': '[혼밥메뉴]간단 열무비빔밥 만드는법,양념장 만드는법',
      'ingre': [
        "밥",
        "열무",
        "참치캔",
        "계란",
        "고추장",
        "참기름",
        "올리고당",
        "깨",
        "마늘",
        "간장",
      ],
    },
    {
      'name': '[백종원레시피]백종원 고등어김치찜,집밥백선생레시피,고등어요리',
      'ingre': [
        "김치",
        "고등어",
        "대파",
        "청양고추",
        "홍고추",
        "무",
        "양파",
        "물",
        "고추가루",
        "간장",
        "마늘",
        "설탕",
        "된장",
        "고추장",
      ],
    },
    {
      'name': '[오늘뭐먹지레시피]강화도쫄면,오늘뭐먹지쫄면레시피',
      'ingre': [
        "오이",
        "오렌지",
        "양파",
        "마늘",
        "고추장",
        "조미료",
        "설탕",
        "세배",
        "깨",
        "콩나물",
        "쫄면",
        "당근",
        "양배추",
        "삶은계란",
      ],
    },
    {
      'name': '[밑반찬레시피]콩나물무침 만드는법,콩나물요리',
      'ingre': [
        "콩나물",
        "대파",
        "물",
        "소금",
        "고추가루",
        "다진마늘",
        "통깨",
        "참기름",
      ],
    },
    {
      'name': '[주말냉장고파먹기요리]샤브샤브 육수만들기,샤브샤브만들기',
      'ingre': [
        "물",
        "육수다시팩",
        "다시마",
        "계란",
        "밥",
        "양파",
        "당근",
        "깻잎",
        "김가루",
        "참기름",
        "대파",
        "숙주",
        "청경채",
        "새송이버섯",
        "표고버섯",
        "느타리버섯",
        "팽이버섯",
        "배추잎",
      ],
    },
    {
      'name': '[식빵요리]딸기쨈식빵쿠키,아이간식 만들기',
      'ingre': [
        "식빵",
        "딸기쨈",
        "슈가파우터(없으면패스)",
      ],
    },
    {
      'name': '[참치캔요리]매콤참치쌈장,매콤참치볶음 만들기',
      'ingre': [
        "참치캔",
        "감자",
        "청양고추",
        "양파",
        "식용유",
        "고추장",
        "케찹",
        "물엿",
        "통깨",
      ],
    },
    {
      'name': ' [알배추요리]오늘뭐먹지 이연복 배추찜 만들기',
      'ingre': [
        "알배추",
        "청피망",
        "홍피망",
        "대파",
        "통마늘",
        "청양고추",
        "물",
        "식초",
        "간장",
        "굴소스",
        "고추기름",
        "설탕",
        "다진마늘",
      ],
    },
    {
      'name': '집들이 음식으로 좋은 차돌박이 샐러드 만드는법',
      'ingre': [
        "차돌박이",
        "샐러드용채소",
        "미림",
        "후추",
        "간장",
        "식초",
        "마늘",
        "참기름",
        "올리브유",
        "깨",
      ],
    },
    {
      'name': '백종원오이무침,초간단오이무침 만드는 법',
      'ingre': [
        "오이",
        "양파",
        "굵은소금",
        "고추가루",
        "설탕",
        "매실액",
        "간장",
        "다진마늘",
        "식초",
        "깨",
      ],
    },
    {
      'name': '식빵사과파이,애플파이 만드는 법',
      'ingre': [
        "사과",
        "버터",
        "설탕",
        "식빵",
        "올리고당",
        "계피가루",
        "계란",
      ],
    },
    {
      'name': '남은반찬으로 옛날도시락 반들기,도시락만들기',
      'ingre': [
        "분홍소세지",
        "계란",
        "소금",
        "밑반찬",
        "양은도시락",
      ],
    },
    {
      'name': ' [밑반찬레시피]애호박볶음 만드는법',
      'ingre': [
        "애호박",
        "대파",
        "홍고추",
        "들기름",
        "다진마늘",
        "소금",
      ],
    },
    {
      'name': '궁중떡볶이 황금레시피,궁중떡볶이 만드는 법',
      'ingre': [
        "떡볶이떡",
        "소고기불고기감",
        "양파",
        "당근",
        "피망",
        "물",
        "식용유",
        "표고버섯",
        "대파",
        "간장",
        "설탕",
        "청주",
        "다진마늘",
        "참기름",
        "후추",
        "통깨",
        "간장",
        "참기름",
        "간장",
        "굴소스",
        "설탕",
        "물엿",
        "참기름",
      ],
    },
    {
      'name': '집밥백선생 백종원 김치 짜글이 찌개,돼지고기김치짜글이',
      'ingre': [
        "사태",
        "대파",
        "양파",
        "새송이버섯",
        "김치",
        "물",
        "고추가루",
        "만능맛간장",
        "고추장",
        "간마늘",
      ],
    },
    {
      'name': '딸기청 만들기,딸기청만드는법',
      'ingre': [
        "열탕한유리병",
        "딸기",
        "설탕",
        "레몬즙",
      ],
    },
    {
      'name': '길거리 토스트 만들기,양배추토스트만들기',
      'ingre': [
        "식빵",
        "계란",
        "슬라이스햄",
        "체다치즈",
        "양배추채",
        "버터",
        "소금",
        "후추",
        "설탕",
        "케찹",
      ],
    },
    {
      'name': '비오는 날에는 김치부침개 만들기 ',
      'ingre': [
        "김치",
        "오징어몸통",
        "청양고추",
        "홍고추",
        "부침가루",
        "물",
        "설탕",
        "고추가루",
      ],
    },
    {
      'name': '깻잎장아찌 만드는 법,깻잎절임,간장깻잎장아찌',
      'ingre': [
        "깻잎",
        "진간장",
        "물",
        "설탕",
        "식초",
      ],
    },
    {
      'name': '집밥 백선생 백종원 콩나물찜 만들기,콩나물요리',
      'ingre': [
        "콩나물",
        "새송이버섯",
        "양파",
        "대파",
        "물",
        "고추장",
        "고추가루",
        "설탕",
        "마늘",
        "맛간장",
      ],
    },
    {
      'name': '딸기잼만들기,딸기잼 만드는법,딸기쨈 만들기',
      'ingre': [
        "딸기",
        "설탕",
        "레몬즙",
        "유리병",
      ],
    },
    {
      'name': '오이소박이 만드는 방법,오이소박이 만드는법',
      'ingre': [
        "오이",
        "부추",
        "굵은소금",
        "물",
        "고추가루",
        "새우젓",
        "멸치액젓",
        "설탕",
        "마늘",
        "생강가루",
      ],
    },
    {
      'name': ' SNS 에서 핫한 생딸기우유 만들기, 생딸기우유 레시피',
      'ingre': [
        "딸기",
        "우유",
        "설탕(또는",
      ],
    },
    {
      'name': '간단하게 버무려 먹는 부추무침,부추겉절이',
      'ingre': [
        "부추",
        "양파",
        "고추가루",
        "간장",
        "참기름",
        "올리고당",
        "깨",
      ],
    },
    {
      'name': '[백종원레시피]백종원 목살스테이크 만들기,목살요리',
      'ingre': [
        "목살",
        "밀가루",
        "통마늘",
        "버터",
        "물",
        "소금",
        "후추",
        "양파",
        "케찹",
        "설탕",
        "간장",
        "식초",
      ],
    },
    {
      'name': '[더덕요리법2]더덕무침 황금레시피,더덕무침 양념장 만드는법',
      'ingre': [
        "더덕",
        "고추가루",
        "진간장",
        "설탕",
        "물엿",
        "깨",
        "후추가루",
        "다진마늘",
        "다진파",
        "맛술",
        "식초",
      ],
    },
    {
      'name': '[더덕요리법1]더덕구이 황금레시피,더덕구이 양념 만드는법',
      'ingre': [
        "더덕",
        "식용유",
        "고추가루",
        "진간장",
        "설탕",
        "물엿",
        "깨",
        "후추가루",
        "마늘",
        "다진파",
        "맛술",
        "고추장",
        "참기름",
        "물",
      ],
    },
    {
      'name': '칼국수 황금레시피,칼국수 만드는법',
      'ingre': [
        "칼국수",
        "당근",
        "양파",
        "호박",
        "부추",
        "대파",
        "물",
        "국간장",
        "다진마늘",
        "후추",
        "소금",
      ],
    },
    {
      'name': '[초간단반찬레시피]단무지 무침 만드는법',
      'ingre': [
        "단무지",
        "쪽파",
        "다진마늘",
        "고추가루",
        "참기름",
        "통깨",
      ],
    },
    {
      'name': '[간단한밑반찬]오징어실채볶음 만들기,가는오징어채볶음',
      'ingre': [
        "오징어실채",
        "식용유",
        "참기름",
        "설탕",
        "간장",
        "굴소스",
        "맛술",
        "올리고당",
        "깨",
        "참기름",
      ],
    },
    {
      'name': '[베이컨요리]간단한 반찬 만들기 베이컨숙주볶음',
      'ingre': [
        "숙주",
        "베이컨",
        "통마늘",
        "청경채",
        "쪽파",
        "참기름",
        "후추",
        "굴소스",
      ],
    },
    {
      'name': ' 집밥 백선생 찹스테이크 만들기,찹스테이크소스만들기',
      'ingre': [
        "소고기등심",
        "노랑파프리카",
        "빨간파프리카",
        "브로콜리",
        "양송이버섯",
        "양파",
        "통마늘",
        "파인애플",
        "버터",
        "허브솔트",
        "미림",
        "올리브유",
        "스테이크소스",
        "굴소스",
        "케찹",
        "꿀",
        "다진마늘",
      ],
    },
    {
      'name': '[봄제철음식]봄동된장무침 만드는 법,봄동겉저리',
      'ingre': [
        "봄동",
        "대파",
        "소금",
        "된장",
        "고추가루",
        "다진마늘",
        "참기름",
        "깨",
        "소금",
      ],
    },
    {
      'name': '[밑반찬레시피]돼지고기장조림 만드는 법 ',
      'ingre': [
        "돼지고기안심",
        "대파",
        "양파",
        "대파",
        "새송이버섯",
        "메추리알",
        "통마늘",
        "무",
        "꽈리고추",
        "청양고추",
        "간장",
        "물",
        "설탕",
        "올리고당",
      ],
    },
    {
      'name': '[순두부요리]맑은 순두부국 만드는 법',
      'ingre': [
        "육수다시팩",
        "국거리멸치",
        "대파",
        "청양고추",
        "계란",
        "순두부",
        "새우젓",
        "마늘",
        "소금",
      ],
    },
    {
      'name': '[또디아요리]간단한 치킨랩 만들기,또띠아롤 트위스터만들기',
      'ingre': [
        "닭가슴살(치킨텐더)",
        "양상추",
        "양파",
        "방울토마토",
        "빵가루",
        "밀가루",
        "계란",
        "머스타드",
        "마요네즈",
        "또띠아",
      ],
    },
    {
      'name': '토마토 스파게티만들기,토마토 스파게티 만드는 법 ',
      'ingre': [
        "스파게티면",
        "베이컨",
        "시판스파게티소스",
        "소세지",
        "통마늘",
        "양파",
        "양송이버섯",
        "브로콜리",
        "방울토마토",
        "소금",
        "올리브유",
        "파슬리가루",
        "파머산치즈가루",
      ],
    },
    {
      'name': '백종원 닭갈비 황금레시피 만드는 법,닭갈비소스',
      'ingre': [
        "닭(닭다리살or닭가슴살)",
        "양배추",
        "고구마",
        "대파",
        "깻잎",
        "떡볶이떡",
        "청양고추",
        "홍고추",
        "진간장",
        "고추장",
        "고추가루",
        "맛술",
        "설탕",
        "다진마늘",
        "참기름",
        "후추",
      ],
    },
    {
      'name': ' [시래기요리]시래기된장무침,시래기무침만들기',
      'ingre': [
        "시래기",
        "멸치다시팩",
        "다시마",
        "물",
        "대파",
        "홍고추",
        "청양고추",
        "된장",
        "고추장",
        "고추가루",
        "마늘",
        "참기름",
      ],
    },
    {
      'name': '감바스 만들기,박나래 감바스 알 아히요 만들기',
      'ingre': [
        "허브맛솔트",
        "파슬리가루",
        "바게트빵",
        "중새우",
        "통마늘",
        "올리브유",
        "페페로치노",
        "허브맛솔트",
        "파슬리가루",
        "바게트빵",
      ],
    },
    {
      'name': ' 발렌타이데이 초콜릿만들기,파베초콜릿만들기 ',
      'ingre': [
        "시리얼",
        "밀크초콜릿",
        "화이트초콜릿",
        "밀크초콜릿",
        "우유",
        "코코아파우더",
        "녹차파우더",
      ],
    },
    {
      'name': '[간단한반찬]마늘종 새우볶음 만드는 법,마른새우 마늘종볶음',
      'ingre': [
        "마늘종",
        "건새우",
        "소금",
        "설탕",
        "청주",
        "간장",
        "깨",
        "참기름",
        "다진마늘",
      ],
    },
    {
      'name': '[알감자요리]매운 알감자 조림 만드는 법',
      'ingre': [
        "알감자",
        "식용유",
        "설탕",
        "고추가루",
        "참기름",
        "깨",
        "다진마늘",
        "간장",
        "물",
      ],
    },
    {
      'name': ' [감자요리]휴게소 별미음식 통감자 버터구이 만드는법,버터알감자',
      'ingre': [
        "알감자",
        "버터",
        "소금",
        "설탕",
        "파슬리가루",
      ],
    },
    {
      'name': ' [꼬막요리]꼬막달래무침 꼬막 삶는법,꼬막양념장',
      'ingre': [
        "꼬막",
        "달래",
        "굵은소금",
        "소금",
        "고추가루",
        "청주또는",
        "간장",
        "마늘",
        "물엿",
        "깨",
        "참기름",
      ],
    },
    {
      'name': '[김치찜 레시피]돼지고기 김치찜 만드는 법',
      'ingre': [
        "김치",
        "삼겹살",
        "대파",
        "청양고추",
        "고추장",
        "설탕",
        "미림",
        "소금",
        "생강가루",
        "고추가루",
        "국간장",
        "마늘",
      ],
    },
    {
      'name': '브런치로 좋은 핫케이크 만들기,팬케이크 만들기',
      'ingre': [
        "핫케익믹스",
        "우유",
        "계란",
        "식용유",
        "블루베리(생략가능)",
        "시럽",
        "화이트초콜릿(생략가능)",
      ],
    },
    {
      'name': ' [식빵요리]브런치메뉴로 좋은 크로크무슈 만드는 법 ',
      'ingre': [
        "식빵",
        "체다치즈",
        "슬라이스햄",
        "피자치즈",
        "버터",
        "밀가루",
        "우유",
        "파마산치즈",
      ],
    },
    {
      'name': ' 백종원 두부조림,두부조림양념,간단한밑반찬 만들기',
      'ingre': [
        "두부",
        "대파",
        "청양고추",
        "새우젓",
        "고추가루",
        "간장",
        "설탕",
        "간마늘",
        "생강가루",
        "들기름",
        "물",
      ],
    },
    {
      'name': '[감자요리]초간단 감자전,감자채전 만들기,감자전만드는법',
      'ingre': [
        "감자",
        "홍고추",
        "청양고추(생략가능)",
        "부침가루(밀가루가능)",
        "물",
        "소금",
        "식용유",
      ],
    },
    {
      'name': ' [봄제철요리-돌나물요리]돗나물,돌나물 무침 만들기',
      'ingre': [
        "돌나물",
        "고추장",
        "식초",
        "설탕",
        "깨",
        "다진마늘",
      ],
    },
    {
      'name': ' 백종원 골뱅이무침,골뱅이무침만드는법,골뱅이소면 레시피',
      'ingre': [
        "골뱅이",
        "양파",
        "당근",
        "오이",
        "깻잎",
        "대파",
        "청양고추",
        "양배추",
        "소면",
        "고추장",
        "설탕",
        "식초",
        "다진마늘",
        "고추가루",
        "참기름",
        "간장",
        "통깨",
      ],
    },
    {
      'name': '[고구마요리]아이간식으로좋은~ 고구마치즈구이 만들기',
      'ingre': [
        "고구마(호박/밤고구마",
        "피자치즈",
        "파슬리가루(생략가능)",
        "우유",
        "올리고당",
        "버터",
        "소금",
      ],
    },
    {
      'name': '명절의 꽃~! 모듬전 만들기',
      'ingre': [
        "밀가루",
        "계란",
        "식용유",
        "쪽파",
        "단무지",
        "햄",
        "맛살",
        "다진돼지고기",
        "두부",
        "당근",
        "계란",
        "양파",
        "전분가루",
        "후추",
        "미림",
        "굴소스",
        "다진마늘",
        "표고버섯",
        "고추",
        "깻잎",
        "호박",
        "새송이버섯",
      ],
    },
    {
      'name': ' [된장찌개레시피] 꽃게된장찌개 만드는 법',
      'ingre': [
        "양파",
        "대파",
        "감자",
        "청양고추",
        "버섯",
        "꽃게",
        "두부",
        "된장",
        "마늘",
        "소금",
        "고추가루",
      ],
    },
    {
      'name': '[밑반찬만들기]무생채 황금레시피,무생채비빔밥까지~!',
      'ingre': [
        "무(20cm크기정도의",
        "쪽파",
        "생강가루",
        "소금",
        "다진마늘",
        "식초",
        "설탕",
        "고추가루",
        "깨",
      ],
    },
    {
      'name': '[간단한 밑반찬 만들기]느타리버섯볶음,느타리버섯요리',
      'ingre': [
        "느타리",
        "당근",
        "대파",
        "레드",
        "옐로우",
        "양파",
        "참기름",
        "다진마늘",
        "간장",
        "설탕",
        "후추",
        "깨",
      ],
    },
    {
      'name': '[만두전골레시피]배추 만두전골만들기',
      'ingre': [
        "배추",
        "느타리버섯",
        "표고버섯",
        "만두(작은사이즈)",
        "대파",
        "두부",
        "홍고추",
        "청양고추",
        "육수",
        "후추가루",
        "소금",
        "마늘",
        "국간장",
        "고추가루",
        "육수",
      ],
    },
    {
      'name': '아이간식으로 좋은 또띠아피자만들기,파인애플피자,새우피자만들기',
      'ingre': [
        "또띠아",
        "방울토마토",
        "양파",
        "양송이버섯",
        "칵테일새우",
        "피자치즈",
        "파인애플",
        "토마토소스",
        "파슬리가루",
        "올리브오일",
        "허브솔트",
      ],
    },
    {
      'name': '아침식사로 좋은 간단한 에그 토스트 만들기',
      'ingre': [
        "슬라이스햄",
        "체다치즈",
        "식빵",
        "계란",
        "버터",
        "허브솔트(없으면소금)",
        "파슬리가루",
      ],
    },
    {
      'name': ' [메추리알요리]메추리알 꼬치 튀김,추억의 분식요리',
      'ingre': [
        "메추리알",
        "밀가루",
        "빵가루",
        "계란",
        "식용유",
        "고추장",
        "케찹",
        "올리고당",
        "마늘",
        "간장",
      ],
    },
    {
      'name': ' [맥주안주만들기]맥앤치즈 레시피,맥앤치즈간단레시피',
      'ingre': [
        "밀가루",
        "마카로니",
        "체다치즈",
        "버터",
        "우유",
        "베이컨",
        "옥수수통조림",
        "후추가루",
        "파슬리",
        "밀가루",
      ],
    },
    {
      'name': '동태찌개 만드는 방법,동태찌개 양념',
      'ingre': [
        "물",
        "양파",
        "무",
        "다시마",
        "대파",
        "파뿌리",
        "멸치",
        "다시마",
        "동태",
        "홍고추",
        "청양고추",
        "콩나물",
        "호박",
        "무",
        "대파",
        "쑥갓",
        "두부",
        "고춧가루",
        "맛술",
        "국간장",
        "마늘",
        "고추장",
        "생강가루",
        "후추",
        "된장",
      ],
    },
    {
      'name': '[고구마요리]고구마간식만들기,고구마맛탕,고구마스틱,고구마튀김',
      'ingre': [
        "설탕",
        "물",
        "올리고당",
        "튀김가루",
        "파슬리가루",
        "고구마",
        "식용유",
      ],
    },
    {
      'name': ' [스팸요리]스팸 빈대떡,스팸 부침개 만들기',
      'ingre': [
        "숙주",
        "스팸",
        "두부",
        "양파",
        "계란",
        "김치",
        "부추",
        "부침가루",
        "식용유",
      ],
    },
    {
      'name': '[밑반찬레시피]고추장 멸치볶음 만드는 법',
      'ingre': [
        "잔멸치",
        "청양고추",
        "아몬드",
        "미림",
        "고춧가루",
        "고추장",
        "다진마늘",
        "올리고당",
        "깨",
        "참기름",
      ],
    },
    {
      'name': '백종원 찜닭 레시피,안동찜닭 황금레시피',
      'ingre': [
        "감자",
        "당근",
        "고구마",
        "새송이버섯",
        "표고버섯",
        "대파",
        "청양고추",
        "홍고추",
        "양파",
        "당면",
        "닭",
        "떡",
        "물",
        "설탕",
        "맛술",
        "간장",
        "대파",
        "생강가루",
        "마늘",
        "참기름",
        "물",
        "카라멜소스",
      ],
    },
    {
      'name': '[간단한 간식만들기]마늘버터떡볶이,길릭떡볶이,간장떡볶이 ',
      'ingre': [
        "밀떡",
        "통마늘",
        "버터",
        "식용유",
        "간장",
        "설탕",
      ],
    },
    {
      'name': '계란말이김밥 만들기,계란김밥 만들기,계란김밥재료',
      'ingre': [
        "밥",
        "양파",
        "당근",
        "쪽파",
        "계란",
        "김밥용햄",
        "김밥용김",
        "소금",
        "참기름",
        "깨",
        "식용유",
      ],
    },
    {
      'name': '[저녁국거리]시금치된장국 만드는법,시금치도니장국 끓이는법',
      'ingre': [
        "시금치",
        "대파",
        "물",
        "멸치",
        "다시마",
        "건새우",
        "된장",
        "국간장",
        "다진마늘",
        "소금",
      ],
    },
    {
      'name': '소고기 유부초밥 맛있게 만드는 법,도시락메뉴',
      'ingre': [
        "유부피",
        "깻잎",
        "당근",
        "소고기다짐육",
        "표고버섯",
        "공기밥",
        "간장",
        "후춧가루",
        "다진마늘",
        "참기름",
        "미림",
        "매실액",
      ],
    },
    {
      'name': '[다시마 요리]다시마 튀각만드는법,다시마튀김,다시마부각',
      'ingre': [
        "다시마",
        "설탕",
        "식용유",
      ],
    },
    {
      'name': '매콤함 비빔당면 만들기,비빔당면 양념',
      'ingre': [
        "당면",
        "부추",
        "당근",
        "통마늘(다진마늘)",
        "간장",
        "국간장",
        "고춧가루",
        "올리고당",
        "참기름",
        "깨",
      ],
    },
    {
      'name': '[간단한브런치]옛날토스트,계란토스트만들기',
      'ingre': [
        "식빵",
        "계란",
        "설탕",
        "식용유",
        "파슬리가루(없으면패스)",
      ],
    },
    {
      'name': '추운날씨에한그릇~ 떡만두국 끓이는법',
      'ingre': [
        "떡국떡",
        "만두",
        "계란",
        "대파",
        "국간장",
        "다진마늘",
        "후추",
        "소금",
        "대파",
        "양파",
        "다시마",
        "멸치다시팩",
      ],
    },
    {
      'name': '[잡채 황금레시피]잡채 만드는 방법, 잡채만들기',
      'ingre': [
        "당면",
        "당근",
        "양파",
        "옐로우",
        "레드",
        "표고버섯",
        "잡채용",
        "시금치",
        "맛술",
        "간장",
        "참기름",
        "마늘",
        "후추",
        "국간장",
        "참기름",
        "다진마늘",
        "간장",
        "설탕",
        "다진마늘",
        "참기름",
      ],
    },
    {
      'name': '[밑반찬레시피]집에서 만드는 김구이,조미김만들기',
      'ingre': [
        "들기름",
        "맛소금",
        "돌김",
        "김구이붓(없으면위생장갑)",
      ],
    },
    {
      'name': '생강차만드는법,생강으로할수있는것,생강청만들기',
      'ingre': [
        "생강",
        "꿀",
        "설탕",
      ],
    },
    {
      'name': '[빼빼로데이]빼빼로 만들기,빼빼로 만드는법',
      'ingre': [
        "롱스틱",
        "오레오과자",
        "웨하스과자",
        "다크초콜렛",
        "핑크초콜렛",
        "화이트초콜렛",
        "​각종크런치나다양한식용구슬",
      ],
    },
    {
      'name': '[오븐요리]제철고구마로 고구마칩 만들기,감자칩만들기',
      'ingre': [
        "고구마",
        "감자",
        "슈가파우더",
        "허브솔트",
      ],
    },
    {
      'name': '돼지고기 짜글이,두부김치짜글이 찌개 밥도둑이지요!',
      'ingre': [
        "물",
        "대파",
        "무",
        "멸치다시팩",
        "두부",
        "대파",
        "감자",
        "양파",
        "김치",
        "돼지고기",
        "고춧가루",
        "고추장",
        "마늘",
        "후추",
        "소주",
        "국간장",
        "설탕",
        "소금",
      ],
    },
    {
      'name': '김밥만들기_치즈김밥만들기,소풍도시락 ',
      'ingre': [
        "맛살",
        "햄",
        "단무지",
        "깻잎",
        "치즈",
        "당근",
        "시금치",
        "계란",
        "밥",
        "소금",
        "참기름",
        "깨",
        "다진마늘",
        "참기름",
        "국간장",
        "깨",
      ],
    },
    {
      'name': '[참치캔요리]깻잎참치전 만들기,도시락반찬 ​',
      'ingre': [
        "계란",
        "깻잎",
        "참치캔",
        "밀가루",
        "양파",
        "청양고추",
        "소금",
        "후추",
        "다진마늘",
      ],
    },
    {
      'name': '춘장으로 짜장만들기,짜장밥만들기,짜장면 만들기',
      'ingre': [
        "호박",
        "당근",
        "양파",
        "감자",
        "대파",
        "돼지고기",
        "춘장",
        "오이",
        "미림",
        "소금",
        "후추",
        "식용유",
        "설탕",
        "녹말가루",
        "물",
      ],
    },
  ]);

  // API 를 통해서 해당 검색결과를 담아옴
  void callAPI() async {
    ytResult = await ytApi.search(this._data, type: 'video');
    ytResult = await ytApi.nextPage();
    setState(() {});
  }

  @override
  void initState() {
    super.initState();
    callAPI();
    _readListData();
  }

  void _readListData() async {
    log('_readLIstData running...');
    final prefs = await SharedPreferences.getInstance();
    final key = 'ListData';
    final value = prefs.getStringList(key);
    var validate = DateTime.now().subtract(Duration(days: 5)); // 유통기한 마감 5일 기준!
    // DateFormat('yyyy-MM-dd').format(validate); // 현재 날짜를 yyyy-MM--dd 형식으로 바꿈.

    try {
      for (int i = 0; i < value!.length; i++) {
        print(value[i]);
        var list = value[i].split('/');
        var listValidate = new DateFormat("yyyy-MM-dd").parse(list[1]);
        if (validate.isBefore(listValidate)) {
          // 유통기한이 얼마 남지 않은 경우
          saved_data.add(ListData(
              purchaseDate: list[0],
              expirationDate: list[1],
              itemName: list[2]));
        }
      }
      setState(() {});
    } catch (e) {
      log('_readData Error catch');
      return;
    }
  }

  @override
  Widget build(BuildContext context) {
    int max = 0, pos = -1, cnt = 0;
    for (int i = 0; i < list.recipes.length; i++) {
      for (int j = 0; j < list.recipes[i].ingre.length; j++) {
        for (int k = 0; k < saved_data.length; k++) {
          if (saved_data[k].itemName == list.recipes[i].ingre[j]) {
            // 일치하는 재료가 있을경우
            cnt++;
          }
        }
      }

      if (cnt > max) {
        max = cnt;
        pos = i;
      }
      cnt = 0;
    }
    if (_data.isNotEmpty)
      return Container(
        padding: EdgeInsets.all(3),
        child: ListView.builder(
          // 표시할 List 의 갯수
          itemCount: ytResult.length,
          itemBuilder: (_, int index) {
            return InkWell(
                onTap: () {
                  Navigator.push(
                      context,
                      MaterialPageRoute(
                          builder: (context) => YoutubePlayerBuilder(
                                player: YoutubePlayer(
                                  controller: YoutubePlayerController(
                                    initialVideoId:
                                        ytResult[index].id.toString(),
                                    // 재생할 video의 id값
                                    flags: YoutubePlayerFlags(
                                      autoPlay: true, // 자동재생 true
                                      mute: false, // 음소거 false
                                    ),
                                  ),
                                ),
                                builder: (context, player) {
                                  return Column(
                                    children: [
                                      player,
                                    ],
                                  );
                                },
                              )));
                },
                child: listItem(index));
          },
        ),
      );
    else {
      if (pos >= 0)
        return Card(
          // 처음 시작시, 빈 Container 출력
          color: Colors.white60,
          child: Container(
            padding: EdgeInsets.all(12.0),
            child: Text(
              '[추천]\n${list.recipes[pos].name}',
              style: TextStyle(fontSize: 20),
              textAlign: TextAlign.center,
            ),
          ),
        );
      else
        return Container(
          child: Text('Error detected'),
        );
    }
  }

  Widget listItem(index) {
    return Card(
      child: Container(
        padding: EdgeInsets.all(12.0),
        child: Row(
          children: <Widget>[
            Image.network(
              ytResult[index].thumbnail?['default']['url'], // 표시할 썸네일 image
              // width: 100,
              // height: 100,
            ),
            Padding(padding: EdgeInsets.only(right: 20.0)),
            Expanded(
                child: Column(
                    mainAxisAlignment: MainAxisAlignment.start,
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: <Widget>[
                  Text(
                    ytResult[index].title, // 해당 동영상 제목
                    softWrap: true,
                    style: TextStyle(fontSize: 18.0),
                  ),
                  Padding(padding: EdgeInsets.only(bottom: 1.5)),
                  Text(
                    ytResult[index].channelTitle, // 채널이름
                    softWrap: true,
                  ),
                  Padding(padding: EdgeInsets.only(bottom: 3.0)),
                  Text(
                    ytResult[index].url, // 해당 동영상 url
                    softWrap: true,
                  ),
                ]))
          ],
        ),
      ),
    );
  }
}
